# Найдите сумму цифр трехзначного числа.

# *Пример:*

# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0)

x = 888
a = 0
while x > 0:
    b = x % 10
    a = a + b
    x = x / 10
print(int(a))